АлогистикТест2/src/Documents/алк_АктОТКПоПакетам/алк_АктОТКПоПакетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_АктОТКПоПакетам</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.алк_ДанныеАктаОТК</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОТК</name>
    <type>
      <types>CatalogRef.алк_ШаблоныОТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пакеты</name>
    <attributes>
      <name>Деффект</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ДанныеАктаОТК/алк_ДанныеАктаОТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ДанныеАктаОТК</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СсылочноеЗначение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Влажность</types>
      <types>CatalogRef.Породы</types>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
      <types>CatalogRef.Длины</types>
      <types>CatalogRef.Сорта</types>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.алк_ШаблоныОТК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Колонка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Documents/алк_АктОТКПоПакетам/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ШаблонОТКПриИзмененииНаСервере()
	
	Объект.Номенклатура = Объект.ШаблонОТК.Номенклатура;	
	СформироватьСписокДефектовПоШаблону();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОТКОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
		ДопПараметры = Новый Структура("ТекущееЗначениеЭлемента", Объект.ШаблонОТК);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСменеШаблона", ЭтотОбъект, ДопПараметры);	
	 
	    ПоказатьВопрос(Оповещение,
	        "При смене шаблона текущие данные будут очищены. Вы уверены?",
	        РежимДиалогаВопрос.ДаНет,
	        0, // таймаут в секундах
	        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	        "Смена шаблона" // (необ.) заголовок
	    );

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСменеШаблона(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Пакеты.Очистить();	
		ШаблонОТКПриИзмененииНаСервере();
   	Иначе	   
		Объект.ШаблонОТК =  Параметры.ТекущееЗначениеЭлемента;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если ЗначениеЗаполнено(Объект.ШаблонОТК) Тогда
		СформироватьСписокДефектовПоШаблону();	
	КонецЕсли;
	
	Если НЕ Параметры.Ключ.Пустая() И ПроверкаЗапрещеныИзменения() Тогда
		ЭтаФорма.Доступность = Ложь;
		Сообщить("Документ открыт только для просмотра. Изменять акты прошлых смен запрещено");
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьСписокДефектовПоШаблону()
	МассивДефектов = Объект.ШаблонОТК.Строки.ВыгрузитьКолонку("Строка");
	Элементы.ПакетыДеффект.СписокВыбора.ЗагрузитьЗначения(МассивДефектов);
КонецПроцедуры

Функция ПроверкаЗапрещеныИзменения()
	Если НЕ РольДоступна("алк_ОТК_Администратор") И НЕ РольДоступна("ПолныеПрава") И НЕ РфпСервер.ТекущаяСмена(Объект.Дата, Объект.Смена, Объект.Участок) Тогда	
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПакетыСерийныйНомерПриИзменении(Элемент)
	
	РезультатПроверкиСН = ПроверитьНаДефектыСН(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.СерийныйНомер);	
	
	Если РезультатПроверкиСН.Количество() > 0 Тогда
		Для Каждого Стр Из РезультатПроверкиСН Цикл
			Сообщить(СтрШаблон("ВНИМАНИЕ! По пакету с номером %1 уже был оформлен акт %2 с дефектом: %3", Стр.СерийныйНомер, Стр.Регистратор, Стр.Дефект));	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьНаДефектыСН(СерийныйНомер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ДанныеАктаОТК.СерийныйНомер,
		|	алк_ДанныеАктаОТК.Строка КАК Дефект,
		|	алк_ДанныеАктаОТК.Регистратор
		|ИЗ
		|	РегистрНакопления.алк_ДанныеАктаОТК КАК алк_ДанныеАктаОТК
		|ГДЕ
		|	алк_ДанныеАктаОТК.СерийныйНомер = &СерийныйНомер";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дефект = Новый Структура;
		Дефект.Вставить("СерийныйНомер", ВыборкаДетальныеЗаписи.СерийныйНомер);
		Дефект.Вставить("Дефект", ВыборкаДетальныеЗаписи.Дефект); 
		Дефект.Вставить("Регистратор", ВыборкаДетальныеЗаписи.Регистратор);
		Результат.Добавить(Дефект);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры
